{
  "title": "GMAT Exam Syllabus",
  "sections": [
    {
      "title": "Updated GMAT Exam Sections 2024",
      "content": [
        "The new GMAT exam sections assess a candidate's abilities in critical thinking, analysis, and\n            problem-solving. It now includes a section on data insights, which will test skills to analyze and draw\n            conclusions from complex data sets. Additionally, the Analytical Writing Assessment (AWA) section and\n            sentence correction no longer exist, along with most geometry questions. The changes aim to better reflect\n            the skills needed for success in today's competitive business environment, without changing the fundamental\n            content.",
        "The Verbal Reasoning section (time allotted: 45 minutes) assesses one’s ability to read, understand,\n            and analyze a given text. Some specific skills it evaluates are reading comprehension, vocabulary, critical\n            reasoning, and logical deduction. Candidates are required to answer a total of 23 questions on reading\n            comprehension and critical reasoning.",
        [
          "Reading comprehension questions are composed of written passages of varying lengths and complexity. The\n              aim is to evaluate one’s ability to identify main ideas, infer meaning, understand logical\n              connections between important points, and deduce conclusions.",
          "Critical reasoning questions typically present a short argument or a logical statement, followed by\n              questions that require test takers to analyze the argument's structure, identify its strengths and\n              weaknesses, and draw logical conclusions. These questions also assess one’s ability to devise a plan\n              of action to address a specific challenge or issue."
        ]
      ]
    },
    {
      "title": "New GMAT Exam Pattern",
      "content": [
        "The GMAT exam takes approximately 2 hours and 15 minutes. It comprises 3 sections: Quantitative Reasoning,\n            Verbal Reasoning, and Data Insights. This version has 64 questions.",
        "The total score you get on the GMAT Focus Edition is\n            determined by your performance on all three sections of the test. The maximum score that can be\n            attained on the GMAT exam is 805.",
        "To learn everything about new GMAT modifications, read our dedicated article on the new GMAT format"
      ]
    },
    {
      "title": "GMAT Verbal Syllabus",
      "content": [
        "The GMAT Verbal Reasoning section assesses your skills in:",
        [
          "Reading written material,",
          "Comprehending written material, and",
          "Evaluating arguments."
        ],
        "There are a total of 23 questions in this section and you get 45 minutes to answer the same. Types of\n            questions in this section are: Reading Comprehension and Critical Reasoning.",
        "This section measures your ability to comprehend words and statements. Mainly, the skills tested\n            include:",
        [
          "Comprehending logical structure",
          "Recognizing supporting idea",
          "Understanding application",
          "Identifying main idea",
          "Drawing inferences",
          "Analysing style"
        ],
        "Let's break down GMAT Reading Comprehension question types for a clearer understanding:",
        "GMAT Reading Comprehension passages, typically around 350 words, assess your ability to interpret,\n            infer, and identify logical relationships. While engaging with the passage, it is important to avoid\n            straying from the given content. Ensure you stay focused on the passage's topic and refrain from\n            incorporating your personal ideas. Bringing external worldly knowledge into the interpretation may lead\n            to divergence from the actual passage content.",
        [
          "Topic: What is the main subject of the passage?",
          "Scope: Which specific aspect of the topic does the passage concentrate on?",
          "Purpose: Why did the author write the passage?",
          "What notes would you jot down on your note board?"
        ],
        "Your GMAT Verbal Ability score significantly depends on Reading Comprehension. Here are foolproof\n            strategies to structure and time your GMAT Reading Comprehension preparation:",
        [
          "Skimming entails a quick read of the entire passage to grasp its general idea.",
          "Different from scanning, which seeks specific facts, skimming focuses on understanding the tone and\n              overall concept."
        ],
        [
          "After skimming, glance at related questions, identifying their types.",
          "Mark questions based on types and approach each accordingly, considering the various question types\n              mentioned above."
        ],
        [
          "Refer back to the passage, reading it thoroughly for tiny details and specific facts.",
          "Stay focused, mindful of the timed nature of the GMAT; prioritize information relevant to the\n              questions."
        ],
        [
          "Start with main idea questions first, requiring less mental effort.",
          "Progress to supporting idea questions, addressing explicit facts.",
          "Proceed in the suggested order for effectiveness, then choose your preferred order."
        ],
        [
          "Outliers are answer choices not explicitly stated but align with the question.",
          "Sharp attention and a strong grasp of the passage's main idea help identify outliers.",
          "Leverage these outliers with solid reasoning to your advantage."
        ],
        "In addition to these preparation tips, you should definitely check out our unique Strategies to Improve Score\n              in GMAT Reading Comprehension to enhance your performance.",
        "In this section, a candidate has to perform an analysis, based on the given argument and mark the right\n            answer. You will be required to extract the relevant data that would either back or oppose the given\n            argument and select the best possible option.",
        "Here is an effective guide on preparing for Critical Reasoning on the GMAT:",
        [
          "Follow the \"map that leads to you\": Familiarize yourself with the topic of critical\n              reasoning. GMAT critical reasoning questions are intentionally analytical and confusing, often filled\n              with jargon and sentences in harmony with themselves rather than being helpful to the student. Avoid\n              excessive reading and focus on decoding controversial theories to identify evidentiary clues crucial\n              for solving the question.",
          "Believe that slow and steady wins the race: Being ambitious means being slow and\n              steady towards your ambition. Speed reading can only help you get so far. For every noteworthy\n              entrance examination in the world, speed reading will only exhibit your reading ability. You need to\n              interpret what's going on in the question. This will help you understand the information provided from\n              the data that needs to be assumed.",
          "Break down the questions sentence-wise: This will help you mindfully assess the\n              situation presented in the question. As much as this question is subjective to an individual\n              candidate’s own prepping strategy, this is also a quandary that states that you need to be\n              smart, rather than being hard on yourself.",
          "Get a \"reason\" to start over new: Avoid wishy-washiness in critical reasoning\n              questions. Align the question with your analytical reasoning capabilities and draw necessary\n              conclusions. Identify both dominant and weak parts of the sentence, practicing the technique of\n              gathering information based on the contextual meaning of the question.",
          "Learning reasoning helps you examine the dense usage of written content: Explore\n              historical, geographical, and social themes within the paragraph. This will help assume or predict\n              solutions for given questions.",
          "Steer ahead of conventional reading practices: Don’t just read, understand,\n              summarize and formulate a derived context with related comments. It is all about throwing yourself\n              open to challenges and successfully testing your power to extract the correct meaning from complex\n              written information. This is also the \"main idea\" behind the birth of the critical reasoning (CR)\n              questions."
        ]
      ]
    },
    {
      "title": "GMAT Quant Syllabus",
      "content": [
        "The Quantitative Reasoning section in the focus edition contains 21 Problem-Solving questions. This\n            section:",
        [
          "evaluates your basic knowledge in algebra and arithmetic.",
          "demands logical and analytical thinking.",
          "does not permit the use of calculators."
        ],
        "Key requirement to excel in this section: Arithmetic and elementary algebra.",
        "You get 45 minutes to solve the Quant section.",
        "The GMAT Quant demands a strategic approach and dedicated effort. To optimize your preparation, follow\n            these essential steps:",
        [
          "The GMAT Quant comprises 21 Problem-Solving questions, allowing 45 minutes for completion. The\n              syllabus encompasses arithmetic and algebra.",
          "Common topics include percentages, ratios, rate problems, algebraic expressions, combinatorics,\n              linear and quadratic equations, and statistical concepts.",
          "Study each topic thoroughly, understand underlying concepts, and assess your strengths and\n              weaknesses."
        ],
        [
          "Tailor a realistic study plan based on your strengths and weaknesses, ensuring a balanced approach.",
          "Allocate dedicated time to each topic, becoming an expert before moving on.",
          "Consistent and focused study sessions are key to mastering the diverse content of the GMAT Quant\n              syllabus."
        ],
        [
          "Leverage official GMAT preparation materials like the GMAT Official Guide and GMATPrep software,\n              available on com.",
          "Practice with real GMAT questions to familiarize yourself with the exam's structure and question\n              types."
        ],
        [
          "Study core principles of arithmetic and algebra to build a strong foundation.",
          "Master basic skills for solving questions of fractions, decimals, percentages, and setting up\n              equations."
        ],
        [
          "Develop effective problem-solving techniques.",
          "Practice solving problems under timed conditions to enhance speed and accuracy."
        ],
        [
          "Analyze and understand the reasoning behind incorrect answers to improve.",
          "Identify patterns in errors and refine your problem-solving approach."
        ],
        [
          "Simulate real exam conditions with full-length GMAT practice tests.",
          "Assess performance, identify weak areas, and refine strategies."
        ],
        [
          "Practice effective time management during study sessions to complete the section within the allotted\n              time on exam day."
        ],
        [
          "Supplement learning with online courses, tutoring, and GMAT forums for diverse perspectives."
        ],
        [
          "Enroll in our comprehensive GMAT Focus\n                Edition coaching classes structured to create a conducive learning atmosphere. Our experienced\n              mentors provide valuable support, helping you ace your GMAT preparation."
        ],
        "Remember that the GMAT Quant section does not feature data sufficiency problems. While the content may\n            have changed, your learning approach should stay constant. So, emphasis on studying math topics since they\n            apply to a variety of question types, particularly in the Data Insights section of the Gmat Focus Edition."
      ]
    },
    {
      "title": "GMAT Data Insights Syllabus",
      "content": [
        "The GMAT Data Insights section evaluates how well you can analyze data to apply it to real-world\n              business scenarios. It also assesses your digital and data literacy. Below is a quick overview:",
        "In the GMAT Data Insights section, a mix of questions will assess your analytical abilities. These\n              questions test your proficiency in interpreting different types of information and making informed\n              decisions. Let us break down the key question types:",
        [
          "Evaluates the ability to dissect and analyze quantitative problems.",
          "Assesses the capability for identifying data relevance.",
          "Determines skill in identifying the point where there is sufficient data to solve the problem."
        ],
        [
          "Measures one’s aptitude in examining various data sources, like text passages and tables.",
          "Checks the ability to analyze each data source to answer multiple questions.",
          "Assesses whether one can draw inferences and evaluate data relevance."
        ],
        [
          "Gauges the ability to sort and analyze tabular data.",
          "Determines proficiency in identifying relevant information or identifying specific conditions."
        ],
        [
          "Assess the capability to interpret information presented in graphical formats.",
          "May require discerning relationships and making inferences based on graphical data."
        ],
        [
          "Measures problem-solving skills in handling complex scenarios.",
          "Tests the ability to evaluate trade-offs, identify relationships between two entities, and solve\n                simultaneous equations."
        ],
        "To master Data Insights, keep these key aspects in mind:",
        [
          "Understanding Data Insights Question Types",
          "Mastering Real-World Data Processing Skills",
          "Build Strategic Study Approach",
          "Utilize Practice Tests for Holistic Assessment",
          "Mastering Time in Data Insights"
        ]
      ]
    },
    {
      "title": "Does Understanding the GMAT Syllabus Boost\n              Exam Preparation?",
      "content": [
        "A thorough understanding of GMAT topics can help you prioritize your study time and allocate more time to\n              areas where you need improvement. Additionally, check out our articles on GMAT preparation to streamline\n              your study approach."
      ]
    },
    {
      "title": "Start Your GMAT Journey with Career Launcher",
      "content": [
        "Join us for a free diagnostic test, access study materials, or sign up for our free webinar!"
      ]
    },
    {
      "title": "What After the GMAT Exam?",
      "content": [
        "Whether you aspire to study abroad or in\n        India, we are here to support your journey every step of the way."
      ]
    },
    {
      "title": "FAQs",
      "content": []
    }
  ]
}